In [60]:
import pandas as pd
import numpy as np
df = pd.read_csv('adult.csv')
df

,age,workclass,fnlwgt,education,educational-num,marital-status,occupation,relationship,race,gender,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32556,27,Private,257302,Assoc-acdm,12,Married-civ-spouse,Tech-support,Wife,White,Female,0,0,38,United-States,<=50K
32557,40,Private,154374,HS-grad,9,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,0,0,40,United-States,>50K
32558,58,Private,151910,HS-grad,9,Widowed,Adm-clerical,Unmarried,White,Female,0,0,40,United-States,<=50K
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

In [61]:
df.columns

Index(['age', 'workclass', 'fnlwgt', 'education', 'educational-num',
       'marital-status', 'occupation', 'relationship', 'race', 'gender',
       'capital-gain', 'capital-loss', 'hours-per-week', 'native-country',
       'income'],
      dtype='object')

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   age              32561 non-null  int64
 1   workclass        32561 non-null  object
 2   fnlwgt           32561 non-null  int64
 3   education        32561 non-null  object
 4   educational-num  32561 non-null  int64
 5   marital-status   32561 non-null  object
 6   occupation       32561 non-null  object
 7   relationship     32561 non-null  object
 8   race             32561 non-null  object
 9   gender           32561 non-null  object
 10  capital-gain     32561 non-null  int64
 11  capital-loss     32561 non-null  int64
 12  hours-per-week   32561 non-null  int64
 13  native-country   32561 non-null  object
 14  income           32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [63]:
df.describe()

,age,fnlwgt,educational-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [64]:
#Q1 : How many men and women (sex feature) are represented in this dataset?
df['gender'].value_counts()

 Male      21790
 Female    10771
Name: gender, dtype: int64

In [66]:
# Data Cleaning 
for col in df.columns:
    if df[col].dtype == 'object':
        df[col] = df[col].str.replace(' ', '')

In [80]:
#Q2: What is the average age (age feature) of women?
df_Female = df[df['gender'] == 'Female'].copy()
avg_age_female = df_Female['age'].mean()
avg_age_female

36.85823043357163

In [79]:
#Q3: What is the percentage of German citizens (native-country feature)?
perc_german_citizens = len(df[df['native-country'] == 'Germany'])/ len(df) * 100
perc_german_citizens

0.42074874850281013

In [87]:
#Q4 What are the mean and standard deviation of age for those who earn more than 50K per year (salary feature) and those who earn less than 50K per year
df_less_50k = df[df['income'] == '<=50K'].copy()
df_great_50k = df[df['income'] == '>50K'].copy()

In [90]:
df_less_50k['age'].describe()

count    24720.000000
mean        36.783738
std         14.020088
min         17.000000
25%         25.000000
50%         34.000000
75%         46.000000
max         90.000000
Name: age, dtype: float64

In [91]:
df_great_50k['age'].describe()

count    7841.000000
mean       44.249841
std        10.519028
min        19.000000
25%        36.000000
50%        44.000000
75%        51.000000
max        90.000000
Name: age, dtype: float64

In [93]:
#Q5:Is it true that people who earn more than 50K have at least a high school education? (education â€“ Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters or Doctorate feature)
df_great_50k['education'].unique()
# Yes it is true - in the dataset looks like the mininum education qualification for those earning more than 50k is HS grad

array(['HS-grad', 'Masters', 'Bachelors', 'Some-college', 'Assoc-voc',
       'Doctorate', 'Prof-school', 'Assoc-acdm', '7th-8th', '12th',
       '10th', '11th', '9th', '5th-6th', '1st-4th'], dtype=object)

In [96]:
#Q6: Display age statistics for each race (race feature) and each gender (sex feature). Use groupby() and describe(). Find the maximum age of men of Amer-Indian-Eskimo race.
df[['race', 'gender', 'age']].groupby(['race', 'gender']).describe()
# Max age for men of Amer-Indian-Eskimo race is 82.0

                               age                                          \
                             count       mean        std   min   25%   50%
race               gender
Amer-Indian-Eskimo Female    119.0  37.117647  13.114991  17.0  27.0  36.0
                   Male      192.0  37.208333  12.049563  17.0  28.0  35.0
Asian-Pac-Islander Female    346.0  35.089595  12.300845  17.0  25.0  33.0
                   Male      693.0  39.073593  12.883944  18.0  29.0  37.0
Black              Female   1555.0  37.854019  12.637197  17.0  28.0  37.0
                   Male     1569.0  37.682600  12.882612  17.0  27.0  36.0
Other              Female    109.0  31.678899  11.631599  17.0  23.0  29.0
                   Male      162.0  34.654321  11.355531  17.0  26.0  32.0
White              Female   8642.0  36.811618  14.329093  17.0  25.0  35.0
                   Male    19174.0  39.652498  13.436029  17.0  29.0  38.0


                             75%   max
race               gender
Amer-Indian-Eskimo Female  46.00  80.0
                   Male    45.00  82.0
Asian-Pac-Islander Female  43.75  75.0
                   Male    46.00  90.0
Black              Female  46.00  90.0
                   Male    46.00  90.0
Other              Female  39.00  74.0
                   Male    42.00  77.0
White              Female  46.00  90.0
                   Male    49.00  90.0

In [107]:
#Q7: Among whom is the proportion of those who earn a lot (>50K) greater: married or single men (marital-status feature)? Consider as married those who have a marital-status starting with Married (Married-civ-spouse, Married-spouse-absent or Married-AF-spouse), the rest are considered bachelors.
df_married_great_50k = df_great_50k[df_great_50k['marital-status'].isin(['Married-civ-spouse', 'Married-spouse-absent', 'Married-AF-spouse'])].copy()
len(df_married_great_50k)

6736

In [102]:
# Estimated income of married 
df_married_great_50k
6736 * 51000

343536000

In [108]:
df_single_great_50k = df_great_50k[df_great_50k['marital-status'].isin(['Never-married', 'Divorced', 'Separated',
       'Widowed'])].copy()
len(df_single_great_50k)

1105

In [106]:
# Estimated income of single 
1105 * 51000

56355000

In [ ]:
# Answer: Married earn around 6 times more (estimated) than single for those who make greater than 50k

In [113]:
#Q8:  What is the maximum number of hours a person works per week (hours-per-week feature)? How many people work such a number of hours, and what is the percentage of those who earn a lot (>50K) among them?

In [110]:
# Max number of hours per week
df['hours-per-week'].max()

99

In [114]:
# How many people work such a number of hours
df_99_hrs = df[df['hours-per-week'] == 99]
len(df_99_hrs)

85

In [117]:
# What is the percentage of those who earn a lot (>50K) among them?
len(df_99_hrs[df_99_hrs['income'] == '>50K'])/len(df_99_hrs) * 100

29.411764705882355

In [122]:
#Q9:Count the average time of work (hours-per-week) for those who earn a little and a lot (salary) for each country (native-country). What will these be for Japan?
df_avg_hrs = df[['native-country', 'income', 'hours-per-week']].groupby(['native-country', 'income'], as_index=False).mean()

In [124]:
df_avg_hrs[df_avg_hrs['native-country'] == 'Japan']

   native-country income  hours-per-week
47          Japan  <=50K       41.000000
48          Japan   >50K       47.958333

In [126]:
#Q10: Find out the total number of hours worked and mean salary as per different occupations.
df[['occupation', 'hours-per-week']].groupby(['occupation']).sum()

                   hours-per-week
occupation
?                           58803
Adm-clerical               141595
Armed-Forces                  366
Craft-repair               173405
Exec-managerial            182920
Farming-fishing             46708
Handlers-cleaners           51988
Machine-op-inspct           81593
Other-service              114342
Priv-house-serv              4900
Prof-specialty             175481
Protective-serv             27823
Sales                      148851
Tech-support                36593
Transport-moving            71316